# Завдання 1. обробка GET-параметра

# Створіть маршрут /greet, який прийматиме параметр name і повертатиме привітання

# Запит: http://127.0.0.1:5000/greet?name=Олександр
# Очікувана відповідь: "Привіт, Олександр!"
# Підказка: використовуйте request.args.get('name') для отримання значення параметра.


# Завдання 2.  форма логіну з POST

# Створіть маршрут /login, який буде обробляти дані форми

# Форма повинна мати поле username і кнопку submit.
# При POSTзапиті сервер має виводити "Вітаємо, [username]!".
# Підказка:  використовуйте request.form.get('username') для отримання даних.


# Завдання 3. API з POST і JSON

# Створіть маршрут /api/message, який прийматиме JSON-об'єкт із 
# текстовим повідомленням та повертатиме "Отримано: [повідомлення]"

# Запит у Postman (POST, JSON-Body):
# {
#   "message": "Привіт, Flask!"
# }