# Завдання 1. 

# Створення бази даних та таблиці гостей готелю

# Створи модель таблиці guests у SQLAlchemy, яка містить такі поля:

# id (ціле число, первинний ключ)
# name (текстове поле, до 100 символів)
# phone_number (текстове поле, до 15 символів)

# Кроки виконання:

# Імпортуй необхідні модулі (DeclarativeBase, Mapped, mapped_column, String).
# Створи клас Base для оголошення моделей.
# Опиши клас Guest, наслідуючи його від Base.
# Використай Base.metadata.create_all(engine), щоб створити таблицю.
# Підказка: Використовуй Mapped, mapped_column(), String(100), String(15). Первинний ключ задається як primary_key=True.

